---
type: PostEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# PostEventArgs

`Autodesk.Revit.DB.Events.PostEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Status | — | `public EventStatus Status { get ; }` |